# BuiltInFailures.RoofFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures Class
BuiltInFailures Class Members See Also
---
Failures about Roof.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RoofFailures
```

Visual Basic
---
```text
Public NotInheritable Class RoofFailures
```

Visual C++
---
```text
public ref class RoofFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RoofFailures
# See Also
BuiltInFailures..::..RoofFailures Members
Autodesk.Revit.DB Namespace